In [3]:
import numpy as np
import pandas as pd
import seaborn as sns


from env import host, password, user 

def get_db_url(user, password, host, db):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'

**1.  Use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, ```df_iris```, from this data.**

In [4]:
df_iris = sns.load_dataset('iris')

* print the first 3 rows

In [5]:
df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

* print the number of rows and columns (shape)

In [6]:
df_iris.shape

(150, 5)

* print the column names

In [7]:
df_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

* print the data type of each column

In [8]:
df_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

* print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [9]:
df_iris.describe()

# recommend changing the species name from string to numerical data

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

**2. Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.**

In [10]:
df_excel = pd.read_csv('Table1_CustDetails.csv')

* assign the first 100 rows to a new dataframe, df_excel_sample

In [11]:
df_excel_sample = df_excel.sample(n=100,axis = 0)

df_excel_sample.shape

(100, 12)

* print the number of rows of your original dataframe

In [12]:
df_excel.shape

(7049, 12)

* print the first 5 column names

In [13]:
columns = list(df_excel.columns.values.tolist())
print(columns[0:5])

['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents']

* print the column names that have a data type of object

In [14]:
object_columns = df_excel.select_dtypes('object')
print(list(object_columns))

['customer_id', 'gender', 'partner', 'dependents', 'payment_type', 'churn']

* compute the range for each of the numeric variables.

In [15]:
variables = df_excel.select_dtypes(exclude = 'object')
print(list(variables))

['is_senior_citizen', 'phone_service', 'internet_service', 'contract_type', 'monthly_charges', 'total_charges']

In [16]:
df_variables = df_excel.select_dtypes(exclude = 'object')
df_variables.min(), df_variables.max()

(is_senior_citizen     0.00
 phone_service         0.00
 internet_service      0.00
 contract_type         0.00
 monthly_charges      18.25
 total_charges        18.80
 dtype: float64,
 is_senior_citizen       1.00
 phone_service           2.00
 internet_service        2.00
 contract_type           2.00
 monthly_charges       118.75
 total_charges        8684.80
 dtype: float64)

3. **Read the data from this google sheet into a dataframe, ```df_google```**

In [5]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

# Use the replace method to modify our Google Sheet share url to be a csv export url.

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

In [6]:
# Use read_csv() method to create our DataFrame.

df_google = pd.read_csv(csv_export_url)

* **print the first 3 rows**

In [7]:
df_google = pd.read_csv('train.csv')
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

* **print the number of rows and columns**

In [22]:
df_google.shape

(891, 12)

* **print the column names**

In [33]:
columns = list(df_google.columns.values.tolist())
print(columns)

['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

* **print the data type of each column**

In [35]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

* **print the summary statistics for each of the numeric variables**

In [42]:
df_numeric = df_google.select_dtypes(exclude = 'object')
df_numeric.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

* **print the unique values for each of your categorical variables**

In [43]:
df_object = df_google.select_dtypes('object')
df_object.nunique(0)

Name        891
Sex           2
Ticket      681
Cabin       147
Embarked      3
dtype: int64